#include<iostream>
using namespace std;
void main()
{
	setlocale(LC_ALL, "Russian");
	cout << "\t\t\t\t\t\t В ЛЕСУ РОДИЛАСЬ ЁЛОЧКА\n\n";
	cout << "\t\t\t\t\t    (cлова Р.Кудашева музыка Л.Бекман)\n\n";
	cout << "\t\t\t\t\t\t В лесу родилась Ёлочка!\n";
	cout << "\t\t\t\t\t\t В лесу она росла.\n";
	cout << "\t\t\t\t\t\t Зимой и летом стройная,\n";
	cout << "\t\t\t\t\t\t Зеленая была.\n\n";
	cout << "\t\t\t\t\t\t Метель ей пела песенку:\n";
	cout << "\t\t\t\t\t\t \"Спи, Ёлочка, бай-бай!\"\n";
	cout << "\t\t\t\t\t\t Мороз снежком укутывал:\n";
	cout << "\t\t\t\t\t\t \"Смотри, не замерзай!\"\n\n";
	cout << "\t\t\t\t\t\t Трусишка зайка серенький\n";
	cout << "\t\t\t\t\t\t Под Ёлочкой скакал.\n";
	cout << "\t\t\t\t\t\t Порою волк, сердитый волк\n";
	cout << "\t\t\t\t\t\t Рысцою пробегал.\n\n";
	cout << "\t\t\t\t\t\t Чу! Снег по лесу частому\n";
	cout << "\t\t\t\t\t\t Под полозом скрипит.\n";
	cout << "\t\t\t\t\t\t Лошадка мохноногая\n";
	cout << "\t\t\t\t\t\t Торопится, бежит.\n\n";
	cout << "\t\t\t\t\t\t Везёт лошадка дровеньки,\n";
	cout << "\t\t\t\t\t\t На дровнях мужичок\n";
	cout << "\t\t\t\t\t\t Срубил он нашу Ёлочку\n";
	cout << "\t\t\t\t\t\t Под самый корешок\n\n";
	cout << "\t\t\t\t\t\t Теперь ты здесь, нарядная,\n";
	cout << "\t\t\t\t\t\t На праздник к нам пришла\n";
	cout << "\t\t\t\t\t\t И много, много радости\n";
	cout << "\t\t\t\t\t\t Детишкам принесла.\n\n";
	cout << "\t\t\t\t\t\t\t\t    (Милькин Сергей Группа СБД121)\n\n";
}
